tap "teamookla/speedtest"
tap "tinted-theming/tinted"

brew "bat"
brew "bat-extras"
brew "delta"
brew "direnv"
brew "eslint_d"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "htop"
brew "jq"
brew "lazygit"
brew "less"
brew "lua-language-server"
brew "mas"
brew "mise"
brew "moreutils"
brew "neovim"
brew "oh-my-posh"
brew "pandoc"
brew "prettierd"
brew "ripgrep"
brew "stow"
brew "stylua"
brew "syncthing"
brew "tealdeer"
brew "tinty"
brew "tmux"
brew "typescript-language-server"
brew "uutils-coreutils"
brew "yamlfmt"
brew "yamllint"
brew "zoxide"

cask "1password"
cask "1password-cli"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "logi-options+"
cask "monitorcontrol"
cask "raycast"
cask "scroll-reverser"
cask "setapp"

mas "1Password for Safari", id: 1569813296
mas "Broadcasts", id: 1469995354
mas "Dark Reader for Safari", id: 1438243180
mas "Fantastical", id: 975937182
mas "GoodLinks", id: 1474335294
mas "Keynote", id: 409183694
mas "Magic Lasso", id: 1198047227
mas "Numbers", id: 409203825
# "Overcast" = 888422857; # Currently broken
mas "Pages", id: 409201541
mas "StopTheMadness Pro", id: 6471380298
